In [1]:
import pandas as pd
from deloitte import Deloitte

In [2]:
data = Deloitte("MA_Exer_PikesPeak_Females.txt")

data.clean_data()

,place,div_total,num,name,age,hometown,gun_time,net_time,pace
0,1,1/86,30,Florence Jepkosgei,22.0,Kenya,32:59,32:58,5:19
1,2,2/86,8,Eunice Chepkirui,21.0,Kenya,33:14,33:13,5:21
2,3,1/247,3200,Elena Orlova,36.0,Gaithersburg MD,34:26,34:25,5:33
3,4,1/173,2,Susannah Kvasnicka,34.0,Great Falls VA,34:43,34:42,5:35
4,5,1/142,6,Casey Smith,26.0,Arlington VA,35:04,35:02,5:39
...,...,...,...,...,...,...,...,...,...
1100,1101,247/247,1847,Alicia Maxwell,35.0,Germantown MD,1:43:47,1:40:39,16:12
1101,1102,110/110,2618,Regina Tenali,47.0,Gaithersburg MD,1:50:31,1:45:22,16:58
1102,1103,171/173,986,Nirmala Donley,32.0,Ellicott City M,1:50:31,1:45:22,16:58
1103,1104,172/173,1214,Heidi Gertner,34.0,Bethesda MD,1:46:49,1:46:49,17:12
1104,1105,173/173,2852,Deborah Zerwitz,33.0,Washington DC,1:46:49,1:46:49,17:12

In [21]:
test_df = data.clean_data()

from datetime import datetime

def try_parsing_date(text):
    for fmt in ('%H:%M:%S', '%M:%S', ':%S'):
        try:
            return datetime.strptime(text, fmt)
        except ValueError:
            pass
    raise ValueError('no valid date format found')

                
test_df['gun_time'] = test_df['gun_time'].map(try_parsing_date)
test_df['gun_time'] = test_df['gun_time'] - datetime(1900, 1, 1) # Remove date part
test_df['gun_time'].dt.total_seconds()

test_df['net_time'] = test_df['net_time'].map(try_parsing_date)
test_df['net_time'] = test_df['net_time'] - datetime(1900, 1, 1) # Remove date part
test_df['net_time'].dt.total_seconds()

test_df['pace'] = test_df['pace'].map(try_parsing_date)
test_df['pace'] = test_df['pace'] - datetime(1900, 1, 1) # Remove date part
test_df['pace'].dt.total_seconds()

#pd.to_datetime(test_df.gun_time, format='%H:%M:%S.%f')

0        319.0
1        321.0
2        333.0
3        335.0
4        339.0
         ...
1100     972.0
1101    1018.0
1102    1018.0
1103    1032.0
1104    1032.0
Name: pace, Length: 1105, dtype: float64

In [24]:
set(test_df['hometown'])

test_df.loc[test_df['hometown']=='',:]

,place,div_total,num,name,age,hometown,gun_time,net_time,pace
222,223,38/173,3368,Sharlene Deskins,41.0,,00:54:37,00:50:53,00:08:12
1073,1074,170/173,3371,Joyce Setsuda,42.0,,01:24:27,01:19:13,00:12:45